In [1]:
!head alumnos.csv

nombre,altura,peso,edad,sexo
Hugo,1.67,60,23,h
Paco,1.73,83,25,h
Luis,1.62,70,28,h
Diana,1.58,58,21,m
Francisco,1.86,98,28,h
Felipe,1.79,100,26,h
Jacinta,1.69,62,20,m
Bernardo,1.6,83,31,h
Marisol,1.6,56,30,m

In [5]:
import pandas as pd
df = pd.read_csv('alumnos.csv')
df.head()

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [7]:
df.shape

(21, 5)

In [11]:
df[10:15]

      nombre  altura  peso  edad sexo
10  Trinidad    1.72    72    21    m
11    Camila    1.63    57    26    m
12  Macarena    1.73    68    27    m
13     Diego    1.62    78    23    h
14   Gonzalo    1.58    67    22    h

In [16]:
altura = df['altura']
type(altura)

pandas.core.series.Series

In [17]:
altura[:10]

0    1.67
1    1.73
2    1.62
3    1.58
4    1.86
5    1.79
6    1.69
7    1.60
8    1.60
9    1.98
Name: altura, dtype: float64